shell-utilities.org
#+TITLE:     Shell utilities
#+AUTHOR:    Fabrice Niessen
#+EMAIL:     (concat "fniessen" at-sign "pirilampo.org")
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en

#+PROPERTY:  header-args :eval no
#+SETUPFILE: bigblow-pirilampo.setup

#+name: current-time
#+begin_src emacs-lisp :eval yes :results silent :tangle no
(format-time-string "%Y%m%d.%H%M")
#+end_src

* Context

** Description

The shell utilities are core shell functions and scripts which I wrote when
doing my day-to-day tasks.  Over time, this will become a *powerful toolkit*.

#+begin_note
Library of Babel needs the ~#+name~ field to "ingest" a code block.
#+end_note

** See also

For similar collections, see:

- http://icodesnippet.com/
- http://exploitsdownload.com/
- http://code.google.com/
- [[https://bbs.archlinux.org/viewtopic.php?id=56646&p=1][Post your handy self made command line utilities]]

** Coding style

- http://wiki.bash-hackers.org/scripting/style

- https://google-styleguide.googlecode.com/svn/trunk/shell.xml

  ~variable_name~ (preferred, ~variableName~ accepted) \\
  ~function_name~ \\
  ~CONSTANT_NAME~

** Prerequisites

- Clear
- Diff
- Iconv

* Shell functions
  :PROPERTIES:
  :header-args+: :tangle bin/shellutils :shebang #!/bin/bash
  :END:

Only use alphanumeric characters and the underscore for function names.

** Exit with an error

The exit status follows the conventions for programs such as =grep=, =cmp=, and
=diff=: it is 2 (or greater) if an error occurred.

#+begin_src shell
die () {
    printf "$(basename $0): $@\n" > /dev/stderr
    exit 2                              # An error occurred.
}
#+end_src

~Die~ *must be a function* so that the calling script does exit with an error.

** Check for executable files

#+begin_src shell
files_executables_p () {
    for x in $@
    do
        command -v $x > /dev/null || die "$x not found."
    done
}
#+end_src

** Check for Cygwin executable files

We sometimes have to check that the ~PATH~ is set right, so that Cygwin
executables (for example, ~whoami~ and ~hostname~) are found before their Windows
counterpart -- to avoid problems of spurious ~\r~ added to the output.

#+begin_src shell
files_cygwin_executables_p () {
    for x in $@
    do
        [ "$(command -v $x)" = "/usr/bin/$x" ] \
            || die "$x is not a Cygwin executable."
    done
}
#+end_src

** Find the name of the parent process

The following is supposed to work on Linux, but doesn't on Cygwin.

#+begin_src shell
pname () {
    ps -o command= -p $PPID | tail -n 1 | awk '{print $1}' | awk -F/ '{print $NF}'
}
#+end_src

* Shell scripts
  :PROPERTIES:
  :header-args+: :shebang #!/bin/bash
  :END:

** Send an email
   :PROPERTIES:
   :header-args+: :tangle bin/mail :shebang #!/bin/bash
   :END:

Send a mail to one or more people.

*** Name

#+begin_src shell :noweb yes :padline no
# mail -- Send simple mail
#+end_src

*** Synopsis

#+begin_src shell
Usage ()
{
    cat << EOF 1>&2
Usage: $CMD [-s SUBJECT] [-a ATTACHMENT]... [-c CC-ADDR] [-b BCC-ADDR] [-f FROM-ADDR] TO-ADDR
Try '$CMD -h' for more information.
EOF
    exit 2
}
#+end_src

*** Description

Send an email using ~mail~:

#+begin_src shell :tangle no
mail -s "Subject" recipient@example.com < /path/to/file
cat /path/to/file | mail -s "Subject" recipient@example.com
echo "Message" | mail -s "Subject" recipient@example.com
#+end_src

