shell-utilities.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Shell utilities</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="Fabrice Niessen" />

<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>







</head>
<body>
<div id="content">
<h1 class="title">Shell utilities</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline5">1. Context</a>
<ul>
<li><a href="#orgheadline1">1.1. Description</a></li>
<li><a href="#orgheadline2">1.2. See also</a></li>
<li><a href="#orgheadline3">1.3. Coding style</a></li>
<li><a href="#orgheadline4">1.4. Prerequisites</a></li>
</ul>
</li>
<li><a href="#orgheadline10">2. Shell functions</a>
<ul>
<li><a href="#orgheadline6">2.1. Exit with an error</a></li>
<li><a href="#orgheadline7">2.2. Check for executable files</a></li>
<li><a href="#orgheadline8">2.3. Check for Cygwin executable files</a></li>
<li><a href="#orgheadline9">2.4. Find the name of the parent process</a></li>
</ul>
</li>
<li><a href="#orgheadline26">3. Shell scripts</a>
<ul>
<li><a href="#orgheadline24">3.1. Send an email</a>
<ul>
<li><a href="#orgheadline11">3.1.1. Name</a></li>
<li><a href="#orgheadline12">3.1.2. Synopsis</a></li>
<li><a href="#orgheadline13">3.1.3. Description</a></li>
<li><a href="#orgheadline14">3.1.4. Options</a></li>
<li><a href="#orgheadline15">3.1.5. Stdin</a></li>
<li><a href="#orgheadline16">3.1.6. Input files</a></li>
<li><a href="#orgheadline17">3.1.7. Environment variables</a></li>
<li><a href="#orgheadline18">3.1.8. Stdout</a></li>
<li><a href="#orgheadline19">3.1.9. Stderr</a></li>
<li><a href="#orgheadline20">3.1.10. Output files</a></li>
<li><a href="#orgheadline21">3.1.11. Exit status</a></li>
<li><a href="#orgheadline22">3.1.12. Examples</a></li>
<li><a href="#orgheadline23">3.1.13. Code</a></li>
</ul>
</li>
<li><a href="#orgheadline25">3.2. Echo text in color</a></li>
</ul>
</li>
<li><a href="#orgheadline28">4. VC</a>
<ul>
<li><a href="#orgheadline27">4.1. Ignore files from the command line</a></li>
</ul>
</li>
<li><a href="#orgheadline31">5. Web security assessments</a>
<ul>
<li><a href="#orgheadline29">5.1. HTTP</a></li>
<li><a href="#orgheadline30">5.2. HTTPS</a></li>
</ul>
</li>
<li><a href="#orgheadline38">6. Netcat</a>
<ul>
<li><a href="#orgheadline32">6.1. Scan only certain ports</a></li>
<li><a href="#orgheadline33">6.2. DNS</a></li>
<li><a href="#orgheadline34">6.3. Spoof source IP address</a></li>
<li><a href="#orgheadline35">6.4. Socat</a></li>
<li><a href="#orgheadline36">6.5. Packet forger</a></li>
<li><a href="#orgheadline37">6.6. Lauching attacks via Tor</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="org-src-container">

<pre class="src src-emacs-lisp" id="orgsrcblock1">(format-time-string <span class="org-string">"%Y%m%d.%H%M"</span>)
</pre>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">1</span> Context</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Description</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The shell utilities are core shell functions and scripts which I wrote when
doing my day-to-day tasks.  Over time, this will become a <b>powerful toolkit</b>.
</p>

<div class="note">
<p>
Library of Babel needs the <code>#+name</code> field to &ldquo;ingest&rdquo; a code block.
</p>

</div>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> See also</h3>
<div class="outline-text-3" id="text-1-2">
<p>
For similar collections, see:
</p>

<ul class="org-ul">
<li><a href="http://icodesnippet.com/">http://icodesnippet.com/</a></li>
<li><a href="http://exploitsdownload.com/">http://exploitsdownload.com/</a></li>
<li><a href="http://code.google.com/">http://code.google.com/</a></li>
<li><a href="https://bbs.archlinux.org/viewtopic.php?id=56646&amp;p=1">Post your handy self made command line utilities</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> Coding style</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="http://wiki.bash-hackers.org/scripting/style">http://wiki.bash-hackers.org/scripting/style</a></li>

<li><p>
<a href="https://google-styleguide.googlecode.com/svn/trunk/shell.xml">https://google-styleguide.googlecode.com/svn/trunk/shell.xml</a>
</p>

<p>
<code>variable_name</code> (preferred, <code>variableName</code> accepted) <br  />
<code>function_name</code> <br  />
<code>CONSTANT_NAME</code>
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> Prerequisites</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Clear</li>
<li>Diff</li>
<li>Iconv</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">2</span> Shell functions</h2>
<div class="outline-text-2" id="text-2">
<p>
Only use alphanumeric characters and the underscore for function names.
</p>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">2.1</span> Exit with an error</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The exit status follows the conventions for programs such as <code>grep</code>, <code>cmp</code>, and
<code>diff</code>: it is 2 (or greater) if an error occurred.
</p>

<div class="org-src-container">

<pre class="src src-shell"><span class="org-function-name">die</span> () {
    <span class="org-builtin">printf</span> <span class="org-string">"$(</span><span class="org-sh-quoted-exec">basename</span><span class="org-string"> $0): $@\n"</span> &gt; /dev/stderr
    <span class="org-keyword">exit</span> 2                              <span class="org-comment-delimiter"># </span><span class="org-comment">an error occurred</span>
}
</pre>
</div>

<p>
<code>Die</code> <b>must be a function</b> so that the calling script does exit with an error.
</p>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">2.2</span> Check for executable files</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-shell"><span class="org-function-name">files_executables_p</span> () {
    <span class="org-keyword">for</span> x<span class="org-keyword"> in</span> $<span class="org-variable-name">@</span>
    <span class="org-keyword">do</span>
        <span class="org-builtin">command</span> -v $<span class="org-variable-name">x</span> &gt; /dev/null || die <span class="org-string">"$x not found."</span>
    <span class="org-keyword">done</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">2.3</span> Check for Cygwin executable files</h3>
<div class="outline-text-3" id="text-2-3">
<p>
We sometimes have to check that the <code>PATH</code> is set right, so that Cygwin
executables (for example, <code>whoami</code> and <code>hostname</code>) are found before their Windows
counterpart &#x2013; to avoid problems of spurious <code>\r</code> added to the output.
</p>

<div class="org-src-container">

<pre class="src src-shell"><span class="org-function-name">files_cygwin_executables_p</span> () {
    <span class="org-keyword">for</span> x<span class="org-keyword"> in</span> $<span class="org-variable-name">@</span>
    <span class="org-keyword">do</span>
        [ <span class="org-string">"$(</span><span class="org-sh-quoted-exec">command</span><span class="org-string"> -v $x)"</span> = <span class="org-string">"/usr/bin/$x"</span> ] || die <span class="org-string">"$x is not a Cygwin executable."</span>
    <span class="org-keyword">done</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">2.4</span> Find the name of the parent process</h3>
<div class="outline-text-3" id="text-2-4">
<p>
The following is supposed to work on Linux, but doesn&rsquo;t on Cygwin.
</p>

<div class="org-src-container">

<pre class="src src-shell"><span class="org-function-name">pname</span> () {
    ps -o <span class="org-variable-name">command</span>= -p $<span class="org-variable-name">PPID</span> | tail -n 1 | awk <span class="org-string">'{print $1}'</span> | awk -F/ <span class="org-string">'{print $NF}'</span>
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline26" class="outline-2">
<h2 id="orgheadline26"><span class="section-number-2">3</span> Shell scripts</h2>
<div class="outline-text-2" id="text-3">
</div>

<div id="outline-container-orgheadline24" class="outline-3">
<h3 id="orgheadline24"><span class="section-number-3">3.1</span> Send an email</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Send a mail to one or more people.
</p>
</div>

<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">3.1.1</span> Name</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">mail -- Send simple mail</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12"><span class="section-number-4">3.1.2</span> Synopsis</h4>
<div class="outline-text-4" id="text-3-1-2">
<div class="org-src-container">

<pre class="src src-shell"><span class="org-function-name">Usage</span> ()
{
    cat &lt;&lt; EOF 1&gt;&amp;2
<span class="org-sh-heredoc">Usage: $CMD [-s SUBJECT] [-a ATTACHMENT]... [-c CC-ADDR] [-b BCC-ADDR] [-f FROM-ADDR] TO-ADDR</span>
<span class="org-sh-heredoc">Try '$CMD -h' for more information.</span>
<span class="org-sh-heredoc">EOF</span>
    <span class="org-keyword">exit</span> 2
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13"><span class="section-number-4">3.1.3</span> Description</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Send an email using <code>mail</code>:
</p>

<div class="org-src-container">

<pre class="src src-shell">mail -s <span class="org-string">"Subject"</span> recipient@example.com &lt; /path/to/file
cat /path/to/file | mail -s <span class="org-string">"Subject"</span> recipient@example.com
<span class="org-builtin">echo</span> <span class="org-string">"Message"</span> | mail -s <span class="org-string">"Subject"</span> recipient@example.com
</pre>
</div>
</div>
</div>
