shell-utilities.org
*** Options

The following options shall be supported:

#+begin_src shell :noweb yes
Help ()
{
    cat << EOF
This is $CMD, version: <<current-time()>>.

Usage: $CMD [-s SUBJECT] [-a ATTACHMENT]... [-c CC-ADDR] [-b BCC-ADDR] [-f FROM-ADDR] TO-ADDR
Send simple mail.
Example: $CMD -s 'Disk failure' bill@example.com < /tmp/message

Options:
  -s  Specify subject on command line
  -a  Attach a file
  -c  Send carbon copies to (comma separated) list of recipients
  -b  Send blind carbon copies to (comma separated) list of recipients
  -f  Set the From address
  -h  Display this help and exit
EOF
    exit 0
}
#+end_src

*** Stdin

When ~mail~ is invoked, standard input shall be the message to be delivered to
the specified addresses.

*** Input files

None.

*** Environment variables

The behavior of ~mail~ is affected by the following environment variable:

- ~SMTP~ ::
     The SMTP connection is made to the server specified by the variable ~SMTP~.

*** Stdout

The standard output shall be that of the ~blat~ command.

*** Stderr

The standard error shall be used only for diagnostic messages.

*** Output files

None.

*** Exit status

The ~mail~ utility returns one of the following values upon exit:

- 0 ::
     Successful completion: one mail was sent.

- 2 ::
     Invalid options were specified on the command line or shell input was
     missing.

Otherwise, the exit status of ~mail~ shall be that of the ~blat~ command.

*** Examples

Here's a shell script that reports the disk usage:

#+begin_src shell :tangle no
( printf "Disk usage:\n" ; du -sh ) | mail -s "Disk usage report" recipient@example.com
#+end_src

Here's another one to backup a configuration folder, archive it, and send it as
an attachment:

#+begin_src shell :tangle no
tar -zcf ~/backup.tar.gz ~/files_to_backup
printf "Archived configuration files\n" | mail -s "Backup data" -a ~/backup.tar.gz recipient@example.com
#+end_src

*** Code

#+begin_src shell
# command name
CMD=$(basename $0)

. shellutils || exit 2

if [ $# -eq 0 ]; then
    Usage
fi

# check for Cygwin executable files (and not their Windows counterpart)
files_cygwin_executables_p "whoami" "hostname"

# default values
SUBJECT="none"
ATTFILES=""                             # files to be attached
CC=""
BCC=""
FROM="<$(whoami)@$(echo $(hostname) | tr '[:upper:]' '[:lower:]')>"
: ${SMTP:="smtp"}                       # set var if not already set
BODY="--"                               # stdin.txt

while getopts "s:c:b:f:a:h" opt
do
    case "$opt" in
        s) SUBJECT="$OPTARG";;
        a) ATTFILES="$ATTFILES $OPTARG";;
        c) CC="$OPTARG";;
        b) BCC="$OPTARG";;
        f) FROM="$OPTARG";;
        h) Help;;
        ,*) Usage;;
    esac
done
shift $(($OPTIND - 1))

MAILTO="$1"
if [ "$MAILTO" = "" ]; then
    Usage
fi

# check presence of stdin contents
[ -t 0 ] && die "Message body is missing."

# check for executable files
files_executables_p "blat"

ATT_SWITCH=""
for attach in $ATTFILES
do
    if [ ! -r $attach ]
    then
        die "File $attach does not exist or is not readable."
    else
        # binary vs text file
        if [ "$(file --brief --mime $attach 2> /dev/null | cut -d/ -f 1)" = "text" ]
        then
            ATT_SWITCH="$ATT_SWITCH -attacht $(cygpath -w $attach)"
        else
            ATT_SWITCH="$ATT_SWITCH -attach $(cygpath -w $attach)"
        fi
    fi
done

CC_SWITCH=""
[ "$CC" = "" ] || CC_SWITCH="-cc ${CC}"

BCC_SWITCH=""
[ "$BCC" = "" ] || BCC_SWITCH="-bcc ${BCC}"

blat -to "$MAILTO" \
     $CC_SWITCH \
     $BCC_SWITCH \
     -subject "$SUBJECT" \
     -f "$FROM" \
     -server "$SMTP" \
     $ATT_SWITCH

# mail ends here
#+end_src

