shell-utilities.html

<div id="outline-container-orgheadline14" class="outline-4">
<h4 id="orgheadline14"><span class="section-number-4">3.1.4</span> Options</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
The following options shall be supported:
</p>

<div class="org-src-container">

<pre class="src src-shell"><span class="org-function-name">Help</span> ()
{
    cat &lt;&lt; EOF
<span class="org-sh-heredoc">This is $CMD, version: 20151224.1256.</span>

<span class="org-sh-heredoc">Usage: $CMD [-s SUBJECT] [-a ATTACHMENT]... [-c CC-ADDR] [-b BCC-ADDR] [-f FROM-ADDR] TO-ADDR</span>
<span class="org-sh-heredoc">Send simple mail.</span>
<span class="org-sh-heredoc">Example: $CMD -s 'Disk failure' bill@example.com &lt; /tmp/message</span>

<span class="org-sh-heredoc">Options:</span>
<span class="org-sh-heredoc">  -s  Specify subject on command line</span>
<span class="org-sh-heredoc">  -a  Attach a file</span>
<span class="org-sh-heredoc">  -c  Send carbon copies to (comma separated) list of recipients</span>
<span class="org-sh-heredoc">  -b  Send blind carbon copies to (comma separated) list of recipients</span>
<span class="org-sh-heredoc">  -f  Set the From address</span>
<span class="org-sh-heredoc">  -h  Display this help and exit</span>
<span class="org-sh-heredoc">EOF</span>
    <span class="org-keyword">exit</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-4">
<h4 id="orgheadline15"><span class="section-number-4">3.1.5</span> Stdin</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
When <code>mail</code> is invoked, standard input shall be the message to be delivered to
the specified addresses.
</p>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-4">
<h4 id="orgheadline16"><span class="section-number-4">3.1.6</span> Input files</h4>
<div class="outline-text-4" id="text-3-1-6">
<p>
None.
</p>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-4">
<h4 id="orgheadline17"><span class="section-number-4">3.1.7</span> Environment variables</h4>
<div class="outline-text-4" id="text-3-1-7">
<p>
The behavior of <code>mail</code> is affected by the following environment variable:
</p>

<dl class="org-dl">
<dt><code>SMTP</code></dt><dd>The SMTP connection is made to the server specified by the variable <code>SMTP</code>.</dd>
</dl>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-4">
<h4 id="orgheadline18"><span class="section-number-4">3.1.8</span> Stdout</h4>
<div class="outline-text-4" id="text-3-1-8">
<p>
The standard output shall be that of the <code>blat</code> command.
</p>
</div>
</div>

<div id="outline-container-orgheadline19" class="outline-4">
<h4 id="orgheadline19"><span class="section-number-4">3.1.9</span> Stderr</h4>
<div class="outline-text-4" id="text-3-1-9">
<p>
The standard error shall be used only for diagnostic messages.
</p>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20"><span class="section-number-4">3.1.10</span> Output files</h4>
<div class="outline-text-4" id="text-3-1-10">
<p>
None.
</p>
</div>
</div>

<div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21"><span class="section-number-4">3.1.11</span> Exit status</h4>
<div class="outline-text-4" id="text-3-1-11">
<p>
The <code>mail</code> utility returns one of the following values upon exit:
</p>

<dl class="org-dl">
<dt>0</dt><dd>Successful completion: one mail was sent.</dd>

<dt>2</dt><dd>Invalid options were specified on the command line or shell input was
missing.</dd>
</dl>

<p>
Otherwise, the exit status of <code>mail</code> shall be that of the <code>blat</code> command.
</p>
</div>
</div>

<div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22"><span class="section-number-4">3.1.12</span> Examples</h4>
<div class="outline-text-4" id="text-3-1-12">
<p>
Here&rsquo;s a shell script that reports the disk usage:
</p>

<div class="org-src-container">

<pre class="src src-shell">( <span class="org-builtin">printf</span> <span class="org-string">"Disk usage:\n"</span> ; du -sh ) | mail -s <span class="org-string">"Disk usage report"</span> recipient@example.com
</pre>
</div>

<p>
Here&rsquo;s another one to backup a configuration folder, archive it, and send it as
an attachment:
</p>

<div class="org-src-container">

<pre class="src src-shell">tar -zcf ~/backup.tar.gz ~/files_to_backup
<span class="org-builtin">printf</span> <span class="org-string">"Archived configuration files\n"</span> | mail -s <span class="org-string">"Backup data"</span> -a ~/backup.tar.gz recipient@example.com
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23"><span class="section-number-4">3.1.13</span> Code</h4>
<div class="outline-text-4" id="text-3-1-13">
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">command name</span>
<span class="org-variable-name">CMD</span>=$(<span class="org-sh-quoted-exec">basename</span> $<span class="org-variable-name">0</span>)

<span class="org-builtin">.</span> shellutils || <span class="org-keyword">exit</span> 2

<span class="org-keyword">if</span> [ $<span class="org-variable-name">#</span> -eq 0 ]; <span class="org-keyword">then</span>
    Usage
<span class="org-keyword">fi</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">check for Cygwin executable files (and not their Windows counterpart)</span>
files_cygwin_executables_p <span class="org-string">"whoami"</span> <span class="org-string">"hostname"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">default values</span>
<span class="org-variable-name">SUBJECT</span>=<span class="org-string">"none"</span>
<span class="org-variable-name">ATTFILES</span>=<span class="org-string">""</span>                             <span class="org-comment-delimiter"># </span><span class="org-comment">files to be attached</span>
<span class="org-variable-name">CC</span>=<span class="org-string">""</span>
<span class="org-variable-name">BCC</span>=<span class="org-string">""</span>
<span class="org-variable-name">FROM</span>=<span class="org-string">"&lt;$(</span><span class="org-sh-quoted-exec">whoami</span><span class="org-string">)@$(</span><span class="org-sh-quoted-exec">echo</span><span class="org-string"> $(</span><span class="org-sh-quoted-exec">hostname</span><span class="org-string">) | tr '[:upper:]' '[:lower:]')&gt;"</span>
: ${<span class="org-variable-name">SMTP</span>:=<span class="org-string">"smtp"</span>}                       <span class="org-comment-delimiter"># </span><span class="org-comment">set var if not already set</span>
<span class="org-variable-name">BODY</span>=<span class="org-string">"--"</span>                               <span class="org-comment-delimiter"># </span><span class="org-comment">stdin.txt</span>

<span class="org-keyword">while </span><span class="org-builtin">getopts</span> <span class="org-string">"s:c:b:f:a:h"</span> opt
<span class="org-keyword">do</span>
    <span class="org-keyword">case</span> <span class="org-string">"$opt"</span><span class="org-keyword"> in</span>
        s) <span class="org-variable-name">SUBJECT</span>=<span class="org-string">"$OPTARG"</span>;;
        a) <span class="org-variable-name">ATTFILES</span>=<span class="org-string">"$ATTFILES $OPTARG"</span>;;
        c) <span class="org-variable-name">CC</span>=<span class="org-string">"$OPTARG"</span>;;
        b) <span class="org-variable-name">BCC</span>=<span class="org-string">"$OPTARG"</span>;;
        f) <span class="org-variable-name">FROM</span>=<span class="org-string">"$OPTARG"</span>;;
        h) Help;;
        *) Usage;;
    <span class="org-keyword">esac</span>
<span class="org-keyword">done</span>
<span class="org-builtin">shift</span> $(($<span class="org-variable-name">OPTIND</span> - 1))

<span class="org-variable-name">MAILTO</span>=<span class="org-string">"$1"</span>
<span class="org-keyword">if</span> [ <span class="org-string">"$MAILTO"</span> = <span class="org-string">""</span> ]; <span class="org-keyword">then</span>
    Usage
<span class="org-keyword">fi</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">check presence of stdin contents</span>
[ -t 0 ] &amp;&amp; die <span class="org-string">"Message body is missing."</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">check for executable files</span>
files_executables_p <span class="org-string">"blat"</span>

<span class="org-variable-name">ATT_SWITCH</span>=<span class="org-string">""</span>
<span class="org-keyword">for</span> attach<span class="org-keyword"> in</span> $<span class="org-variable-name">ATTFILES</span>
<span class="org-keyword">do</span>
    <span class="org-keyword">if</span> [ <span class="org-negation-char">!</span> -r $<span class="org-variable-name">attach</span> ]
    <span class="org-keyword">then</span>
        die <span class="org-string">"File $attach does not exist or is not readable."</span>
    <span class="org-keyword">else</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">binary vs text file</span>
        <span class="org-keyword">if</span> [ <span class="org-string">"$(</span><span class="org-sh-quoted-exec">file</span><span class="org-string"> --brief --mime $attach 2&gt; /dev/null | cut -d/ -f 1)"</span> = <span class="org-string">"text"</span> ]
        <span class="org-keyword">then</span>
            <span class="org-variable-name">ATT_SWITCH</span>=<span class="org-string">"$ATT_SWITCH -attacht $(</span><span class="org-sh-quoted-exec">cygpath</span><span class="org-string"> -w $attach)"</span>
        <span class="org-keyword">else</span>
            <span class="org-variable-name">ATT_SWITCH</span>=<span class="org-string">"$ATT_SWITCH -attach $(</span><span class="org-sh-quoted-exec">cygpath</span><span class="org-string"> -w $attach)"</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">fi</span>
<span class="org-keyword">done</span>

<span class="org-variable-name">CC_SWITCH</span>=<span class="org-string">""</span>
[ <span class="org-string">"$CC"</span> = <span class="org-string">""</span> ] || <span class="org-variable-name">CC_SWITCH</span>=<span class="org-string">"-cc ${CC}"</span>

<span class="org-variable-name">BCC_SWITCH</span>=<span class="org-string">""</span>
[ <span class="org-string">"$BCC"</span> = <span class="org-string">""</span> ] || <span class="org-variable-name">BCC_SWITCH</span>=<span class="org-string">"-bcc ${BCC}"</span>

blat -to <span class="org-string">"$MAILTO"</span> <span class="org-sh-escaped-newline">\</span>
     $<span class="org-variable-name">CC_SWITCH</span> <span class="org-sh-escaped-newline">\</span>
     $<span class="org-variable-name">BCC_SWITCH</span> <span class="org-sh-escaped-newline">\</span>
     -subject <span class="org-string">"$SUBJECT"</span> <span class="org-sh-escaped-newline">\</span>
     -f <span class="org-string">"$FROM"</span> <span class="org-sh-escaped-newline">\</span>
     -server <span class="org-string">"$SMTP"</span> <span class="org-sh-escaped-newline">\</span>
     $<span class="org-variable-name">ATT_SWITCH</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">mail ends here</span>
</pre>
</div>
</div>
</div>
</div>
