shell-utilities.org
** Echo text in color

#+begin_src shell :tangle ~/bin/cecho
cecho () {
    black="\e[30m"
    red="\e[31m"
    green="\e[32m"
    yellow="\e[33m"
    blue="\e[34m"
    magenta="\e[35m"
    cyan="\e[36m"
    white="\e[37m"

    BLACK="\e[1;30m"
    RED="\e[1;31m"
    GREEN="\e[1;32m"
    YELLOW="\e[1;33m"
    BLUE="\e[1;34m"
    MAGENTA="\e[1;35m"
    CYAN="\e[1;36m"
    WHITE="\e[1;37m"

    reset="\e[0m"

    color=${YELLOW}
    printf "$color$1$reset\n"
}

cecho "$@"
#+end_src

* VC
  :PROPERTIES:
  :header-args+: :shebang #!/bin/bash
  :END:

http://superuser.com/questions/44787/looping-through-subdirectories-and-running-a-command-in-each

#+name: vc-update
#+begin_src shell :results verbatim
for dir in ~/src/*
do
    cecho "Updating $dir:"
    if [ -d $dir/.git ]; then
        (cd $dir && git pull)
    elif [ -d $dir/.svn ]; then
        (cd $dir && svn update)
    fi
    printf "\n"
done
#+end_src

If you need it to be recursive:

#+name: git-recursive-update
#+begin_src shell
find -type d -printf "%f" -exec  sh -c "cd \"{}\" && git pull"  \;
#+end_src

See http://snipplr.com/view/6228/recursively-find-subversion-working-copies-and-update/

** Ignore files from the command line

Add a file (or a file glob pattern) to ignore without deleting the previous
value of the ~svn:ignore~ property... from the command line.

#+begin_src shell :tangle bin/svnignore
# Usage: svnignore admin/notes/\*.tex

target="$1"
targetdirectory=$(dirname $target)
targetfilepattern=$(basename $target)

svnignores=$(svn propget svn:ignore "$targetdirectory")
svnignores="$svnignores"$'\n'"$targetfilepattern"
printf "Ignore '$targetfilepattern'\n"
svn propset svn:ignore "$svnignores" "$targetdirectory"
#+end_src

* Web security assessments

** HTTP

From Hacking Exposed Web Applications:

#+begin_src shell :tangle bin/getit.sh
#!/bin/sh
# mike's getit.sh script
if [ -z $1 ]; then
    echo -e "\n\tUsage: $0 <host> <URL>"
    exit
fi
echo -e "GET $2 HTTP/1.0\n\n" | \
nc -vv $1 80
#+end_src

#+begin_src shell
getit.sh www.missioncriticalit.com /index.html
#+end_src

#+begin_src shell
getit.sh www.victim.com /index.html | grep -i "<form"
#+end_src

#+begin_src shell
getit.sh www.victim.com /index.html | grep -i "input type"
#+end_src

** HTTPS

#+begin_src shell :tangle bin/sgetit.sh
#!/bin/sh
# mike's sgetit.sh script
if [ -z $1 ]; then
    echo -e "\n\tUsage: $0 <SSL host> <URL>"
    exit
fi
echo -e "GET $2 HTTP/1.0\n\n" | \
openssl s_client -quiet -connect $1:443 2>/dev/null
#+end_src

#+begin_src shell
sgetit.sh www.victim.com /secure/admin.html
#+end_src

