shell-utilities.html

<div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25"><span class="section-number-3">3.2</span> Echo text in color</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-shell"><span class="org-function-name">cecho</span> () {
    <span class="org-variable-name">black</span>=<span class="org-string">"\e[30m"</span>
    <span class="org-variable-name">red</span>=<span class="org-string">"\e[31m"</span>
    <span class="org-variable-name">green</span>=<span class="org-string">"\e[32m"</span>
    <span class="org-variable-name">yellow</span>=<span class="org-string">"\e[33m"</span>
    <span class="org-variable-name">blue</span>=<span class="org-string">"\e[34m"</span>
    <span class="org-variable-name">magenta</span>=<span class="org-string">"\e[35m"</span>
    <span class="org-variable-name">cyan</span>=<span class="org-string">"\e[36m"</span>
    <span class="org-variable-name">white</span>=<span class="org-string">"\e[37m"</span>

    <span class="org-variable-name">BLACK</span>=<span class="org-string">"\e[1;30m"</span>
    <span class="org-variable-name">RED</span>=<span class="org-string">"\e[1;31m"</span>
    <span class="org-variable-name">GREEN</span>=<span class="org-string">"\e[1;32m"</span>
    <span class="org-variable-name">YELLOW</span>=<span class="org-string">"\e[1;33m"</span>
    <span class="org-variable-name">BLUE</span>=<span class="org-string">"\e[1;34m"</span>
    <span class="org-variable-name">MAGENTA</span>=<span class="org-string">"\e[1;35m"</span>
    <span class="org-variable-name">CYAN</span>=<span class="org-string">"\e[1;36m"</span>
    <span class="org-variable-name">WHITE</span>=<span class="org-string">"\e[1;37m"</span>

    <span class="org-variable-name">reset</span>=<span class="org-string">"\e[0m"</span>

    <span class="org-variable-name">color</span>=${<span class="org-variable-name">YELLOW</span>}
    <span class="org-builtin">printf</span> <span class="org-string">"$color$1$reset\n"</span>
}

cecho <span class="org-string">"$@"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline28" class="outline-2">
<h2 id="orgheadline28"><span class="section-number-2">4</span> VC</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="http://superuser.com/questions/44787/looping-through-subdirectories-and-running-a-command-in-each">http://superuser.com/questions/44787/looping-through-subdirectories-and-running-a-command-in-each</a>
</p>

<div class="org-src-container">

<pre class="src src-shell" id="orgsrcblock2"><span class="org-keyword">for</span> dir<span class="org-keyword"> in</span> ~/src/*
<span class="org-keyword">do</span>
    cecho <span class="org-string">"Updating $dir:"</span>
    <span class="org-keyword">if</span> [ -d $<span class="org-variable-name">dir</span>/.git ]; <span class="org-keyword">then</span>
        (<span class="org-builtin">cd</span> $<span class="org-variable-name">dir</span> &amp;&amp; git pull)
    <span class="org-keyword">elif</span> [ -d $<span class="org-variable-name">dir</span>/.svn ]; <span class="org-keyword">then</span>
        (<span class="org-builtin">cd</span> $<span class="org-variable-name">dir</span> &amp;&amp; svn update)
    <span class="org-keyword">fi</span>
    <span class="org-builtin">printf</span> <span class="org-string">"\n"</span>
<span class="org-keyword">done</span>
</pre>
</div>

<p>
If you need it to be recursive:
</p>

<div class="org-src-container">

<pre class="src src-shell" id="orgsrcblock3">find -type d -printf <span class="org-string">"%f"</span> -exec  sh -c <span class="org-string">"cd \"{}\" &amp;&amp; git pull"</span>  <span class="org-string">\;</span>
</pre>
</div>

<p>
See <a href="http://snipplr.com/view/6228/recursively-find-subversion-working-copies-and-update/">http://snipplr.com/view/6228/recursively-find-subversion-working-copies-and-update/</a>
</p>
</div>

<div id="outline-container-orgheadline27" class="outline-3">
<h3 id="orgheadline27"><span class="section-number-3">4.1</span> Ignore files from the command line</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Add a file (or a file glob pattern) to ignore without deleting the previous
value of the <code>svn:ignore</code> property&#x2026; from the command line.
</p>

<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Usage: svnignore admin/notes/\*.tex</span>

<span class="org-variable-name">target</span>=<span class="org-string">"$1"</span>
<span class="org-variable-name">targetdirectory</span>=$(<span class="org-sh-quoted-exec">dirname</span> $<span class="org-variable-name">target</span>)
<span class="org-variable-name">targetfilepattern</span>=$(<span class="org-sh-quoted-exec">basename</span> $<span class="org-variable-name">target</span>)

<span class="org-variable-name">svnignores</span>=$(<span class="org-sh-quoted-exec">svn</span> propget svn:ignore <span class="org-string">"$targetdirectory"</span>)
<span class="org-variable-name">svnignores</span>=<span class="org-string">"$svnignores"</span>$<span class="org-string">'\n'"$targetfilepattern"</span>
<span class="org-builtin">printf</span> <span class="org-string">"Ignore '$targetfilepattern'\n"</span>
svn propset svn:ignore <span class="org-string">"$svnignores"</span> <span class="org-string">"$targetdirectory"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline31" class="outline-2">
<h2 id="orgheadline31"><span class="section-number-2">5</span> Web security assessments</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29"><span class="section-number-3">5.1</span> HTTP</h3>
<div class="outline-text-3" id="text-5-1">
<p>
From Hacking Exposed Web Applications:
</p>

<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">!/bin/</span><span class="org-keyword">sh</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">mike's getit.sh script</span>
<span class="org-keyword">if</span> [ -z $<span class="org-variable-name">1</span> ]; <span class="org-keyword">then</span>
<span class="org-builtin">echo</span> -e <span class="org-string">"\n\tUsage: $0 &lt;host&gt; &lt;URL&gt;"</span>
<span class="org-keyword">exit</span>
<span class="org-keyword">fi</span>
<span class="org-builtin">echo</span> -e <span class="org-string">"GET $2 HTTP/1.0\n\n"</span> | <span class="org-sh-escaped-newline">\</span>
nc -vv $<span class="org-variable-name">1</span> 80
</pre>
</div>

<div class="org-src-container">

<pre class="src src-shell">getit.sh www.missioncriticalit.com /index.html
</pre>
</div>

<div class="org-src-container">

<pre class="src src-shell">getit.sh www.victim.com /index.html | grep -i <span class="org-string">"&lt;form"</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-shell">getit.sh www.victim.com /index.html | grep -i <span class="org-string">"input type"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30"><span class="section-number-3">5.2</span> HTTPS</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">!/bin/</span><span class="org-keyword">sh</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">mike's sgetit.sh script</span>
<span class="org-keyword">if</span> [ -z $<span class="org-variable-name">1</span> ]; <span class="org-keyword">then</span>
<span class="org-builtin">echo</span> -e <span class="org-string">"\n\tUsage: $0 &lt;SSL host&gt; &lt;URL&gt;"</span>
<span class="org-keyword">exit</span>
<span class="org-keyword">fi</span>
<span class="org-builtin">echo</span> -e <span class="org-string">"GET $2 HTTP/1.0\n\n"</span> | <span class="org-sh-escaped-newline">\</span>
openssl s_client -quiet -connect $<span class="org-variable-name">1</span>:443 2&gt;/dev/null
</pre>
</div>

<div class="org-src-container">

<pre class="src src-shell">sgetit.sh www.victim.com /secure/admin.html
</pre>
</div>
</div>
</div>
</div>
