shell-utilities.org
* Netcat

Here is a script which will port scan and banner grab automatically with
netcat. It will check for the SSH and MySQL version by connecting and saving
the results and it will see if the HTTP server is vulnerable to the =TRACE=
method, look in the dumpfile ~/tmp/bannergrab~ and look for
=<script>alert(123)</script>= if you can find that back you got yourself a
vulnerable server.

#+begin_src shell :tangle bin/nc_bgrab
#!/bin/sh

range="10.10.10.";

# You can change this to a port range $(seq 20 25) is port 20-25
ports="20 21 22 23 25 53 80 110 111 443 3306 6000";

http_header="HEAD / HTTP/0.1\n\n";

for host in $(seq 2 254); do
    for port in $ports; do
        echo "[+] Testing "$range$host":"$port;
        result=$(nc -zv -w 1 $range$host $port 2>&1 | grep succeeded);
        if [ -n "$result" ]; then
            echo "\n"$range$host":"$port"\n" >> "/tmp/bannergrab"
            if [ "$port" -eq "22" ]; then
                echo "Found open port "$range$host":"$port" Here might be some SSH server, it echoes the SSH version to you on connecting when lucky.";
                nc -v -w 1 $range$host $port >> "/tmp/bannergrab";
            fi;
            if [ "$port" -eq "80" ]; then
                echo "Found open port "$range$host":"$port" Trying to fingerprint with HEAD and see if the server is vulnerable to TRACE XSSing";
                echo $http_header | nc -v -w 1 $range$host $port >> "/tmp/bannergrab"
                echo "TRACE / HTTP/1.1\nHost: $range$host\nuser-agent: <script>alert(123)</script>\n\n" | nc -v -w 2 $range$host $port >> "/tmp/bannergrab"
            fi;
            if [ "$port" -eq "3306" ]; then
                echo "Found open port "$range$host":"$port" Possible MySQL installation found, saving the banner for later inspection, the MySQL version can be found in this.";
                nc -v -w 1 $range$host $port >> "/tmp/bannergrab";
            fi;
        fi;
    done
done
#+end_src

A lot more on http://h.ackack.net/cheatsheets/netcat/: how to workaround =-e
cmd.exe= option which disappeared, etc.

** Scan only certain ports

#+begin_src shell
nc -z -w 1 -v -v 10.10.10.11 20-30,53,80,100-112,443,6000-6050
#+end_src

** DNS

#+begin_src shell
nc -p 53 -w 2 -v -v firewall.yournetwork.com 53
nc -u -p 53 -w 2 -v -v firewall.yournetwork.com 53
#+end_src

** Spoof source IP address

=-s= option to Netcat: does not work under Cygwin...

** Socat

Learning socat in terms of netcat: http://jdimpson.livejournal.com/6534.html

- *Remote access server*

  #+begin_src shell
  socat TCP-LISTEN:2323,reuseaddr EXEC:/bin/bash
  #+end_src

- *Data forwarder* (aka simple proxy)

  #+begin_src shell
  socat TCP-L:2323 TCP:localhost:22
  #+end_src

  And of course, you can replace either address with any other socat address
  we've already talked about (UDP, UDP-L), or ones we'll talk about in another
  post (e.g. SSL).

** Packet forger

SendIP

** Lauching attacks via Tor

http://www.oreillynet.com/onlamp/blog/2005/07/launching_attacks_via_tor.html
