shell-utilities.html

<div id="outline-container-orgheadline38" class="outline-2">
<h2 id="orgheadline38"><span class="section-number-2">6</span> Netcat</h2>
<div class="outline-text-2" id="text-6">
<p>
Here is a script which will port scan and banner grab automatically with
netcat. It will check for the SSH and MySQL version by connecting and saving
the results and it will see if the HTTP server is vulnerable to the <code>TRACE</code>
method, look in the dumpfile <code>/tmp/bannergrab</code> and look for
<code>&lt;script&gt;alert(123)&lt;/script&gt;</code> if you can find that back you got yourself a
vulnerable server.
</p>

<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">!/bin/</span><span class="org-keyword">sh</span>

<span class="org-variable-name">range</span>=<span class="org-string">"10.10.10."</span>;

<span class="org-comment-delimiter"># </span><span class="org-comment">You can change this to a port range $(</span><span class="org-sh-quoted-exec">seq</span><span class="org-comment"> 20 25) is port 20-25</span>
<span class="org-variable-name">ports</span>=<span class="org-string">"20 21 22 23 25 53 80 110 111 443 3306 6000"</span>;

<span class="org-variable-name">http_header</span>=<span class="org-string">"HEAD / HTTP/0.1\n\n"</span>;

<span class="org-keyword">for</span> host<span class="org-keyword"> in</span> $(<span class="org-sh-quoted-exec">seq</span> 2 254); <span class="org-keyword">do</span>
    <span class="org-keyword">for</span> port<span class="org-keyword"> in</span> $<span class="org-variable-name">ports</span>; <span class="org-keyword">do</span>
        <span class="org-builtin">echo</span> <span class="org-string">"[+] Testing "</span>$<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span><span class="org-string">":"</span>$<span class="org-variable-name">port</span>;
        <span class="org-variable-name">result</span>=$(<span class="org-sh-quoted-exec">nc</span> -zv -w 1 $<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span> $<span class="org-variable-name">port</span> 2&gt;&amp;1 | grep succeeded);
        <span class="org-keyword">if</span> [ -n <span class="org-string">"$result"</span> ]; <span class="org-keyword">then</span>
            <span class="org-builtin">echo</span> <span class="org-string">"\n"</span>$<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span><span class="org-string">":"</span>$<span class="org-variable-name">port</span><span class="org-string">"\n"</span> &gt;&gt; <span class="org-string">"/tmp/bannergrab"</span>
            <span class="org-keyword">if</span> [ <span class="org-string">"$port"</span> -eq <span class="org-string">"22"</span> ]; <span class="org-keyword">then</span>
                <span class="org-builtin">echo</span> <span class="org-string">"Found open port "</span>$<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span><span class="org-string">":"</span>$<span class="org-variable-name">port</span><span class="org-string">" Here might be some SSH server, it echoes the SSH version to you on connecting when lucky."</span>;
                nc -v -w 1 $<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span> $<span class="org-variable-name">port</span> &gt;&gt; <span class="org-string">"/tmp/bannergrab"</span>;
            <span class="org-keyword">fi</span>;
            <span class="org-keyword">if</span> [ <span class="org-string">"$port"</span> -eq <span class="org-string">"80"</span> ]; <span class="org-keyword">then</span>
                <span class="org-builtin">echo</span> <span class="org-string">"Found open port "</span>$<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span><span class="org-string">":"</span>$<span class="org-variable-name">port</span><span class="org-string">" Trying to fingerprint with HEAD and see if the server is vulnerable to TRACE XSSing"</span>;
                <span class="org-builtin">echo</span> $<span class="org-variable-name">http_header</span> | nc -v -w 1 $<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span> $<span class="org-variable-name">port</span> &gt;&gt; <span class="org-string">"/tmp/bannergrab"</span>
                <span class="org-builtin">echo</span> <span class="org-string">"TRACE / HTTP/1.1\nHost: $range$host\nuser-agent: &lt;script&gt;alert(123)&lt;/script&gt;\n\n"</span> | nc -v -w 2 $<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span> $<span class="org-variable-name">port</span> &gt;&gt; <span class="org-string">"/tmp/bannergrab"</span>
            <span class="org-keyword">fi</span>;
            <span class="org-keyword">if</span> [ <span class="org-string">"$port"</span> -eq <span class="org-string">"3306"</span> ]; <span class="org-keyword">then</span>
                <span class="org-builtin">echo</span> <span class="org-string">"Found open port "</span>$<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span><span class="org-string">":"</span>$<span class="org-variable-name">port</span><span class="org-string">" Possible MySQL installation found, saving the banner for later inspection, the MySQL version can be found in this."</span>;
                nc -v -w 1 $<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span> $<span class="org-variable-name">port</span> &gt;&gt; <span class="org-string">"/tmp/bannergrab"</span>;
            <span class="org-keyword">fi</span>;
        <span class="org-keyword">fi</span>;
    <span class="org-keyword">done</span>
<span class="org-keyword">done</span>
</pre>
</div>

<p>
A lot more on <a href="http://h.ackack.net/cheatsheets/netcat/">http://h.ackack.net/cheatsheets/netcat/</a>: how to workaround <code>-e
cmd.exe</code> option which disappeared, etc.
</p>
</div>

<div id="outline-container-orgheadline32" class="outline-3">
<h3 id="orgheadline32"><span class="section-number-3">6.1</span> Scan only certain ports</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-shell">nc -z -w 1 -v -v 10.10.10.11 20-30,53,80,100-112,443,6000-6050
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline33" class="outline-3">
<h3 id="orgheadline33"><span class="section-number-3">6.2</span> DNS</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">

<pre class="src src-shell">nc -p 53 -w 2 -v -v firewall.yournetwork.com 53
nc -u -p 53 -w 2 -v -v firewall.yournetwork.com 53
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline34" class="outline-3">
<h3 id="orgheadline34"><span class="section-number-3">6.3</span> Spoof source IP address</h3>
<div class="outline-text-3" id="text-6-3">
<p>
<code>-s</code> option to Netcat: does not work under Cygwin&#x2026;
</p>
</div>
</div>

<div id="outline-container-orgheadline35" class="outline-3">
<h3 id="orgheadline35"><span class="section-number-3">6.4</span> Socat</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Learning socat in terms of netcat: <a href="http://jdimpson.livejournal.com/6534.html">http://jdimpson.livejournal.com/6534.html</a>
</p>

<ul class="org-ul">
<li><p>
<b>Remote access server</b>
</p>

<div class="org-src-container">

<pre class="src src-shell">socat TCP-LISTEN:2323,reuseaddr EXEC:/bin/bash
</pre>
</div></li>

<li><p>
<b>Data forwarder</b> (aka simple proxy)
</p>

<div class="org-src-container">

<pre class="src src-shell">socat TCP-L:2323 TCP:localhost:22
</pre>
</div>

<p>
And of course, you can replace either address with any other socat address
we&rsquo;ve already talked about (UDP, UDP-L), or ones we&rsquo;ll talk about in another
post (e.g. SSL).
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline36" class="outline-3">
<h3 id="orgheadline36"><span class="section-number-3">6.5</span> Packet forger</h3>
<div class="outline-text-3" id="text-6-5">
<p>
SendIP
</p>
</div>
</div>

<div id="outline-container-orgheadline37" class="outline-3">
<h3 id="orgheadline37"><span class="section-number-3">6.6</span> Lauching attacks via Tor</h3>
<div class="outline-text-3" id="text-6-6">
<p>
<a href="http://www.oreillynet.com/onlamp/blog/2005/07/launching_attacks_via_tor.html">http://www.oreillynet.com/onlamp/blog/2005/07/launching_attacks_via_tor.html</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Fabrice Niessen</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
